{
  "featured": [
    {
      "id": "dev-toolkit",
      "title": "NosytLabs Website",
      "description": "A modern, responsive website built with Astro and TailwindCSS featuring interactive components, dark mode support, and a Windows 95-inspired desktop interface. Includes blog functionality, project portfolio, and service pages with advanced animations and user experience features.",
      "imageUrl": "/images/projects/nosytlabs-website-screenshot.svg",
      "category": "Web Development",
      "technologies": ["Astro", "JavaScript", "TailwindCSS", "HTML5", "CSS3"],
      "completionDate": "2024-12-15",
      "client": "NosytLabs",
      "githubUrl": "https://github.com/NosytLabs/nosytlabs.com",
      "demoUrl": "https://nosytlabs.com",
      "outcome": "A professional business website showcasing services and expertise. Features responsive design, interactive elements, and comprehensive content management. Serves as the primary online presence for NosytLabs with integrated blog and portfolio sections."
    },
    {
      "id": "mining-dashboard",
      "title": "Crypto Mining Calculator",
      "description": "A web-based cryptocurrency mining profitability calculator that helps miners evaluate potential earnings based on hardware specifications, electricity costs, and current market conditions. Features real-time price data integration and customizable mining scenarios.",
      "imageUrl": "/images/projects/crypto-calculator-screenshot.svg",
      "category": "Crypto Mining",
      "technologies": ["JavaScript", "HTML5", "CSS3", "Chart.js", "CoinGecko API"],
      "completionDate": "2024-11-20",
      "client": "Crypto Mining Community",
      "githubUrl": "https://github.com/NosytLabs",
      "demoUrl": "https://nosytlabs.com/tools/mining-calculator",
      "outcome": "A practical tool for evaluating mining profitability with realistic calculations. Helps users make informed decisions about mining investments by providing accurate cost-benefit analysis based on current market conditions and hardware specifications."
    },
    {
      "id": "stream-helper",
      "title": "Kick.com MCP Integration",
      "description": "A Model Context Protocol (MCP) server integration for Kick.com streaming platform, enabling automated chat interactions and stream management. Provides API connectivity for content creators to enhance their streaming experience with programmatic controls.",
      "imageUrl": "/images/projects/mobile-banking.jpg",
      "category": "Content Creation",
      "technologies": ["JavaScript", "Node.js", "MCP Protocol", "Kick.com API"],
      "completionDate": "2024-10-30",
      "client": "Content Creators",
      "githubUrl": "https://github.com/NosytLabs/KickMCP",
      "demoUrl": "https://github.com/NosytLabs/KickMCP",
      "outcome": "An open-source MCP server for Kick.com integration, providing developers and content creators with programmatic access to streaming platform features. Demonstrates expertise in API integration and streaming platform development."
    },
    {
      "id": "nosytos95",
      "title": "NosytOS95",
      "description": "A Windows 95-inspired web interface featuring classic applications like Doom II, Duck Hunt, Notepad, and AI chat functionality. Includes authentic sounds, animations, and a command line terminal with working file system simulation. A creative showcase of front-end development skills.",
      "imageUrl": "/images/projects/nosytos-screenshot.svg",
      "category": "Web Development",
      "technologies": ["JavaScript", "HTML5", "CSS3", "Canvas API", "Web Audio API"],
      "completionDate": "2024-09-15",
      "client": "NosytLabs",
      "githubUrl": "https://github.com/NosytLabs/nosytlabs.com",
      "demoUrl": "https://nosytlabs.com/nosytos95",
      "outcome": "A creative portfolio piece demonstrating advanced front-end development skills and attention to detail. Features authentic Windows 95 interface recreation with working applications, sound effects, and interactive elements. Showcases technical creativity and nostalgic design implementation."
    }
  ],
  "recent": [
    {
      "id": "code-navigator",
      "title": "Development Utilities Collection",
      "description": "A collection of small web-based utilities for developers including code formatters, JSON validators, base64 encoders, and color palette generators. Simple, fast tools for common development tasks without the need for external dependencies or complex installations.",
      "imageUrl": "/images/projects/e-commerce.jpg",
      "category": "Developer Tools",
      "technologies": ["JavaScript", "HTML5", "CSS3", "Local Storage API"],
      "completionDate": "2024-08-20",
      "client": "Developer Community",
      "githubUrl": "https://github.com/NosytLabs",
      "demoUrl": "https://nosytlabs.com/tools",
      "outcome": "A practical collection of lightweight development tools that work entirely in the browser. Provides quick access to common utilities without requiring external services or installations. Demonstrates clean, efficient JavaScript development practices."
    },
    {
      "id": "mining-calculator",
      "title": "3D Print Cost Calculator",
      "description": "A web application for calculating 3D printing costs including material usage, electricity consumption, and time estimates. Supports multiple printer types (FDM and resin) with customizable material costs and printer specifications. Helps makers and businesses estimate project costs accurately.",
      "imageUrl": "/images/projects/blockchain-supply.jpg",
      "category": "3D Printing",
      "technologies": ["JavaScript", "HTML5", "CSS3", "Chart.js", "Local Storage"],
      "completionDate": "2024-07-10",
      "client": "3D Printing Community",
      "githubUrl": "https://github.com/NosytLabs",
      "demoUrl": "https://nosytlabs.com/tools/3d-print-calculator",
      "outcome": "A practical tool for 3D printing cost estimation that helps users make informed decisions about print projects. Includes support for various materials and printer configurations, making it useful for both hobbyists and small businesses offering 3D printing services."
    },
    {
      "id": "print-settings-helper",
      "title": "3D Print Settings Database",
      "description": "A curated database of 3D printing settings for popular printers including Creality Ender 3 S1 Pro and Elegoo Saturn 2. Features material-specific profiles, troubleshooting guides, and community-contributed settings. Helps users achieve better print quality with tested configurations.",
      "imageUrl": "/images/projects/ai-solutions.jpg",
      "category": "3D Printing",
      "technologies": ["JavaScript", "JSON", "HTML5", "CSS3", "GitHub Pages"],
      "completionDate": "2024-06-25",
      "client": "3D Printing Community",
      "githubUrl": "https://github.com/NosytLabs",
      "demoUrl": "https://nosytlabs.com/3d-printing/settings",
      "outcome": "A practical resource for 3D printing enthusiasts featuring tested settings and configurations. Provides reliable starting points for various materials and printer combinations, helping users avoid common printing issues and achieve better results."
    },
    {
      "id": "code-snippets",
      "title": "Code Snippets Collection",
      "description": "A curated collection of useful code snippets for web development including JavaScript utilities, CSS animations, and HTML templates. Features copy-to-clipboard functionality and organized categories for quick reference. Focuses on practical, reusable code patterns.",
      "imageUrl": "/images/projects/data-dashboard.jpg",
      "category": "Developer Tools",
      "technologies": ["JavaScript", "HTML5", "CSS3", "Prism.js", "Clipboard API"],
      "completionDate": "2024-05-15",
      "client": "Developer Community",
      "githubUrl": "https://github.com/NosytLabs",
      "demoUrl": "https://nosytlabs.com/snippets",
      "outcome": "A practical collection of code snippets that developers can quickly copy and adapt for their projects. Organized by category and technology, making it easy to find relevant examples for common development tasks."
    },
    {
      "id": "content-analytics",
      "title": "Content Creation Resources",
      "description": "A collection of resources and guides for content creators including streaming setup guides, thumbnail templates, and basic analytics tracking. Focuses on practical advice for getting started with content creation on platforms like YouTube and Kick.com.",
      "imageUrl": "/images/projects/iot-platform.jpg",
      "category": "Content Creation",
      "technologies": ["HTML5", "CSS3", "JavaScript", "Markdown", "GitHub Pages"],
      "completionDate": "2024-04-30",
      "client": "Content Creators",
      "githubUrl": "https://github.com/NosytLabs",
      "demoUrl": "https://nosytlabs.com/content-creation",
      "outcome": "A helpful resource collection for new content creators featuring practical guides and templates. Provides actionable advice based on real experience with content creation and streaming platforms."
    }
  ],
  "categories": [
    {
      "id": "developer-tools",
      "name": "Developer Tools"
    },
    {
      "id": "artificial-intelligence",
      "name": "Artificial Intelligence"
    },
    {
      "id": "crypto-mining",
      "name": "Crypto Mining"
    },
    {
      "id": "3d-printing",
      "name": "3D Printing"
    },
    {
      "id": "content-creation",
      "name": "Content Creation"
    },
    {
      "id": "web-development",
      "name": "Web Development"
    }
  ]
}
